# DB Connection 2 가지 방법

1. pymysql 

1. sqlalchemy

In [1]:
import pandas as pd

## 1. 순수 Python

In [2]:
#----vanila mysql connect --------------------------------
import pymysql.cursors

host = 'localhost'
user_id = 'root'
pswd = 'Password12345'
database = 'test_schema'
try:
    con = pymysql.connect(host=host, user=user_id, password=pswd, db=database, charset='utf8mb4')
    print(f"Connected to database : host - {host}, user - {user_id},")
except:
    print(f"Connection failed {con}")
    
cursor = con.cursor()

Connected to database : host - localhost, user - root,

In [3]:
cursor.execute('DROP TABLE IF EXISTS Trucks')
stmt = cursor.execute('CREATE TABLE Trucks(\
                      serial_no varchar(20) PRIMARY KEY NOT NULL, \
                      model VARCHAR(20) NOT NULL, \
                      manufacturer VARCHAR(20) NOT NULL, \
                      Engine_size VARCHAR(20) NOT NULL, \
                      Truck_Class VARCHAR(20) NOT NULL)')
print(stmt)

0

## insert record

In [4]:
stmt = cursor.execute("INSERT INTO Trucks(serial_no, model, manufacturer, Engine_size, Truck_Class) \
                VALUES('A1234', 'Lonestar', 'International Trucks', 'Cummins ISX15', 'Class 8'), \
                            ('B5432', 'Volvo', 'Volvo Trucks', 'Volvo D11', 'Class 8'), \
                            ('C1278', 'Hyundai', 'Hyundai Trucks', 'Truck Co', 'Class 8')")
print(stmt)

3

## query

In [5]:
cursor.execute('select * from Trucks')
row = cursor.fetchone()
print(row)

row = cursor.fetchall()
print(row)

('A1234', 'Lonestar', 'International Trucks', 'Cummins ISX15', 'Class 8')
(('B5432', 'Volvo', 'Volvo Trucks', 'Volvo D11', 'Class 8'), ('C1278', 'Hyundai', 'Hyundai Trucks', 'Truck Co', 'Class 8'))

## Using Pandas

In [6]:
df = pd.read_sql("select * from Trucks", con=con)
df

  serial_no     model          manufacturer    Engine_size Truck_Class
0     A1234  Lonestar  International Trucks  Cummins ISX15     Class 8
1     B5432     Volvo          Volvo Trucks      Volvo D11     Class 8
2     C1278   Hyundai        Hyundai Trucks       Truck Co     Class 8

## commit

In [7]:
con.commit()
con.close()

## 2. sqlalchemy

In [8]:
import sqlalchemy
from sqlalchemy import create_engine
engine = create_engine(f"mysql+pymysql://{user_id }:{pswd}@{host}/{database}?charset=utf8", convert_unicode=True)
conn = engine.connect()
transaction = conn.begin()

In [9]:
df = pd.read_sql("select * from Trucks", con=conn)
df.head()

  serial_no     model          manufacturer    Engine_size Truck_Class
0     A1234  Lonestar  International Trucks  Cummins ISX15     Class 8
1     B5432     Volvo          Volvo Trucks      Volvo D11     Class 8
2     C1278   Hyundai        Hyundai Trucks       Truck Co     Class 8